tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "zero-sh/tap"

# Tool for managing dock items
brew "dockutil"

# Select default apps for documents and URL schemes on macOS
brew "duti"

# Maintain consistent coding style between multiple editors
brew "editorconfig"

# Take GitHub to the command line
brew "gh"

# Distributed revision control system
brew "git"

# Mac App Store command-line interface
brew "mas"

# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"

# Version control system designed to be a better CVS
brew "svn"

# Small tool to set macOS user defaults from a YAML file
brew "zero-sh/tap/apply-user-defaults"

# Radically simple personal bootstrapping tool for macOS
brew "zero-sh/tap/zero"

cask "bbedit"
cask "firefox"
cask "fliqlo"
cask "github"
cask "google-chrome"
cask "hazel"
cask "keepingyouawake"
cask "mailtrackerblocker"
cask "muzzle"
cask "notion"
cask "rectangle"
cask "thingsmacsandboxhelper"
cask "zoom"

# Cask Fonts (https://github.com/Homebrew/homebrew-cask-fonts)

cask "font-anonymous-pro"          # Mark Simonson
cask "font-atkinson-hyperlegible"  # Braille Institute
cask "font-autour-one"             # Sorkin Type
cask "font-balsamiq-sans"          # Balsamiq
cask "font-besley"                 # indestructible type*
cask "font-bodoni-moda"            # indestructible type*
cask "font-cabin-condensed"        # Impallari Type
cask "font-cabin"                  # Impallari Type
cask "font-caveat-brush"           # Impallari Type
cask "font-caveat"                 # Impallari Type
cask "font-contrail-one"           # Riccardo De Franceschi
cask "font-corinthia"              # Robert Leuschke
cask "font-crimson-pro"            # Jacques Le Bailly
cask "font-david-libre"            # Monotype Imaging Inc.
cask "font-domine"                 # Impallari Type
cask "font-et-book"                # Edward Tufte
cask "font-fjalla-one"             # Sorkin Type
cask "font-foundry-sterling"       # The Foundry Types
cask "font-goblin-one"             # Sorkin Type
cask "font-goudy-bookletter-1911"  # The League of Moveable Type / Barry Schwartz
cask "font-gravitas-one"           # Sorkin Type
cask "font-inconsolata"            # Raph Levien
cask "font-inter"                  # Rasmus Andersson
cask "font-jost"                   # indestructible type*
cask "font-knewave"                # The League of Moveable Type / Tyler Finck
cask "font-league-gothic"          # The League of Moveable Type / Caroline Hadilaksono / Micah Rich / Tyler Finck
cask "font-league-mono"            # The League of Moveable Type / Tyler Finck
cask "font-league-script"          # The League of Moveable Type / Haley Fiege
cask "font-league-spartan"         # The League of Moveable Type / Caroline Hadilaksono / Micah Rich / Tyler Finck
cask "font-lemonada"               # Mohamed Gaber, Eduardo Tunni
cask "font-libre-baskerville"      # Impallari Type
cask "font-libre-caslon-display"   # Impallari Type
cask "font-libre-caslon-text"      # Impallari Type
cask "font-libre-franklin"         # Impallari Type
cask "font-life-savers"            # Impallari Type
cask "font-limelight"              # Sorkin Type
cask "font-luckiest-guy"           # Astigmatic
cask "font-luxurious-roman"        # Robert Leuschke
cask "font-luxurious-script"       # Robert Leuschke
cask "font-merriweather"           # Sorkin Type
cask "font-ms-madi"                # Robert Leuschke
cask "font-mulish"                 # Vernon Adams,
cask "font-oldenburg"              # Nicole Fally
cask "font-oswald"                 # Vernon Adams
cask "font-ovo"                    # Nicole Fally
cask "font-plaster"                # Sorkin Type
cask "font-poller-one"             # Yvonne Schüttler
cask "font-poppins-latin"          # Jonny Pinhorn
cask "font-public-sans"            # USWDS
cask "font-quattrocento"           # Impallari Type
cask "font-qwitcher-grypen"        # Robert Leuschke
cask "font-redacted-script"        # Christian Naths
cask "font-redacted"               # Christian Naths
cask "font-rye"                    # Nicole Fally
cask "font-sancreek"               # Vernon Adams
cask "font-short-stack"            # James Grieshaber
cask "font-shrikhand"              # Jonny Pinhorn
cask "font-sorts-mill-goudy"       # The League of Moveable Type / Barry Schwartz
cask "font-square-peg"             # Robert Leuschke
cask "font-style-script"           # Robert Leuschke
cask "font-trocchi"                # Vernon Adams
cask "font-vidaloka"               # Cyreal

# Quick Look Plugins (https://github.com/sindresorhus/quick-look-plugins)

cask "qlmarkdown"

mas "1Password", id: 1333542190
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Keynote", id: 409183694
mas "NextDNS", id: 1464122853
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pins for Pinboard", id: 1547106997
mas "Pixelmator", id: 407963104
mas "Shareful", id: 1522267256
mas "Slack", id: 803453959
mas "System Color Picker", id: 1545870783
mas "Things 3", id: 904280696
mas "Velja", id: 1607635845
